Tekla Open API Reference for Tekla Structures 2025
Lot Methods
The PartFilterExpressions.Lot type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PartFilterExpressions.Lot Class
Tekla.Structures.Filtering.Categories Namespace